
**Initializing the backend...**

```diff
+Successfully configured the backend "s3"! Terraform will automatically
+use this backend unless the backend configuration changes.
```

**Initializing provider plugins...**
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (terraform-providers/aws) 2.26.0...

```diff
+Terraform has been successfully initialized!
```
**Refreshing Terraform state in-memory prior to plan...**
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

**aws_s3_bucket.index_bucket: Refreshing state... [id=s3pypi-index]**
**aws_s3_bucket.artifact_bucket: Refreshing state... [id=s3pypi-artifacts]**
**aws_sns_topic.update_topic: Refreshing state... [id=arn:aws:sns:us-east-1:385198630581:s3pypi-updates]**
**aws_s3_bucket_notification.artifact_notification: Refreshing state... [id=s3pypi-artifacts]**

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
```diff
+    create
```

Terraform will perform the following actions:

  **# aws_iam_policy.generate_base_index** will be created
```diff
+    resource "aws_iam_policy" "generate_base_index" {
+        arn    = (known after apply)
+        id     = (known after apply)
+        name   = "s3pypi-generate-base-index"
+        path   = "/"
+        policy = jsonencode(
```
            {
```diff
+                Statement = [
+                    {
+                        Action   = [
+                            "s3:HeadBucket",
+                            "s3:ListObjects",
```
                        ]
```diff
+                        Effect   = "Allow"
+                        Resource = [
+                            "arn:aws:s3:::s3pypi-index",
```
                        ]
```diff
+                        Sid      = ""
```
                    },
```diff
+                    {
+                        Action   = "s3:*"
+                        Effect   = "Allow"
+                        Resource = [
+                            "arn:aws:s3:::s3pypi-index/index.html",
```
                        ]
```diff
+                        Sid      = ""
```
                    },
                ]
```diff
+                Version   = "2012-10-17"
```
            }
        )
    }

  **# aws_iam_policy.generate_proj_index** will be created
```diff
+    resource "aws_iam_policy" "generate_proj_index" {
+        arn    = (known after apply)
+        id     = (known after apply)
+        name   = "s3pypi-generate-proj-index"
+        path   = "/"
+        policy = (known after apply)
```
    }

  **# aws_iam_role.gen_index_role** will be created
```diff
+    resource "aws_iam_role" "gen_index_role" {
+        arn                   = (known after apply)
+        assume_role_policy    = jsonencode(
```
            {
```diff
+                Statement = [
+                    {
+                        Action    = "sts:AssumeRole"
+                        Effect    = "Allow"
+                        Principal = {
+                            Service = "lambda.amazonaws.com"
```
                        }
```diff
+                        Sid       = ""
```
                    },
                ]
```diff
+                Version   = "2012-10-17"
```
            }
        )
```diff
+        create_date           = (known after apply)
+        force_detach_policies = false
+        id                    = (known after apply)
+        max_session_duration  = 3600
+        name                  = "s3pypi-gen-index"
+        path                  = "/"
+        unique_id             = (known after apply)
```
    }

  **# aws_iam_role.gen_proj_index_role** will be created
```diff
+    resource "aws_iam_role" "gen_proj_index_role" {
+        arn                   = (known after apply)
+        assume_role_policy    = jsonencode(
```
            {
```diff
+                Statement = [
+                    {
+                        Action    = "sts:AssumeRole"
+                        Effect    = "Allow"
+                        Principal = {
+                            Service = "lambda.amazonaws.com"
```
                        }
```diff
+                        Sid       = ""
```
                    },
                ]
```diff
+                Version   = "2012-10-17"
```
            }
        )
```diff
+        create_date           = (known after apply)
+        force_detach_policies = false
+        id                    = (known after apply)
+        max_session_duration  = 3600
+        name                  = "s3pypi-gen-proj-index"
+        path                  = "/"
+        unique_id             = (known after apply)
```
    }

  **# aws_iam_role_policy_attachment.gen_index_basic_lambda** will be created
```diff
+    resource "aws_iam_role_policy_attachment" "gen_index_basic_lambda" {
+        id         = (known after apply)
+        policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+        role       = "s3pypi-gen-index"
```
    }

  **# aws_iam_role_policy_attachment.gen_index_s3_access** will be created
```diff
+    resource "aws_iam_role_policy_attachment" "gen_index_s3_access" {
+        id         = (known after apply)
+        policy_arn = (known after apply)
+        role       = "s3pypi-gen-index"
```
    }

  **# aws_iam_role_policy_attachment.gen_proj_index_basic_lambda** will be created
```diff
+    resource "aws_iam_role_policy_attachment" "gen_proj_index_basic_lambda" {
+        id         = (known after apply)
+        policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+        role       = "s3pypi-gen-proj-index"
```
    }

  **# aws_iam_role_policy_attachment.gen_proj_index_s3_access** will be created
```diff
+    resource "aws_iam_role_policy_attachment" "gen_proj_index_s3_access" {
+        id         = (known after apply)
+        policy_arn = (known after apply)
+        role       = "s3pypi-gen-proj-index"
```
    }

  **# aws_lambda_function.gen_index_lambda** will be created
```diff
+    resource "aws_lambda_function" "gen_index_lambda" {
+        arn                            = (known after apply)
+        function_name                  = "s3pypi-gen-index"
+        handler                        = "handler.handle"
+        id                             = (known after apply)
+        invoke_arn                     = (known after apply)
+        last_modified                  = (known after apply)
+        memory_size                    = 128
+        publish                        = false
+        qualified_arn                  = (known after apply)
+        reserved_concurrent_executions = -1
+        role                           = (known after apply)
+        runtime                        = "python3.7"
+        s3_bucket                      = "s3pypi-lambdas"
+        s3_key                         = "s3pypi-gen-index/s3pypi-gen-index-0.1.5.zip"
+        source_code_hash               = (known after apply)
+        source_code_size               = (known after apply)
+        timeout                        = 3
+        version                        = (known after apply)
```

```diff
+        environment {
+            variables = {
+                "INDEX_BUCKET" = "s3pypi-index"
```
            }
        }

```diff
+        tracing_config {
+            mode = (known after apply)
```
        }
    }

  **# aws_lambda_function.gen_proj_index_lambda** will be created
```diff
+    resource "aws_lambda_function" "gen_proj_index_lambda" {
+        arn                            = (known after apply)
+        function_name                  = "s3pypi-gen-proj-index"
+        handler                        = "handler.handle"
+        id                             = (known after apply)
+        invoke_arn                     = (known after apply)
+        last_modified                  = (known after apply)
+        memory_size                    = 128
+        publish                        = false
+        qualified_arn                  = (known after apply)
+        reserved_concurrent_executions = -1
+        role                           = (known after apply)
+        runtime                        = "python3.7"
+        s3_bucket                      = "s3pypi-lambdas"
+        s3_key                         = "s3pypi-gen-proj-index/s3pypi-gen-proj-index-0.1.1.zip"
+        source_code_hash               = (known after apply)
+        source_code_size               = (known after apply)
+        timeout                        = 3
+        version                        = (known after apply)
```

```diff
+        environment {
+            variables = (known after apply)
```
        }

```diff
+        tracing_config {
+            mode = (known after apply)
```
        }
    }

  **# aws_lambda_permission.gen_index_from_sns** will be created
```diff
+    resource "aws_lambda_permission" "gen_index_from_sns" {
+        action        = "lambda:InvokeFunction"
+        function_name = "s3pypi-gen-index"
+        id            = (known after apply)
+        principal     = "sns.amazonaws.com"
+        source_arn    = (known after apply)
+        statement_id  = (known after apply)
```
    }

  **# aws_lambda_permission.gen_proj_index_from_sns** will be created
```diff
+    resource "aws_lambda_permission" "gen_proj_index_from_sns" {
+        action        = "lambda:InvokeFunction"
+        function_name = "s3pypi-gen-proj-index"
+        id            = (known after apply)
+        principal     = "sns.amazonaws.com"
+        source_arn    = "arn:aws:sns:us-east-1:385198630581:s3pypi-updates"
+        statement_id  = (known after apply)
```
    }

  **# aws_sns_topic.rebuild_root_topic** will be created
```diff
+    resource "aws_sns_topic" "rebuild_root_topic" {
+        arn    = (known after apply)
+        id     = (known after apply)
+        name   = "s3pypi-rebuild-root"
+        policy = (known after apply)
```
    }

**Plan:** 13 to add, 0 to change, 0 to destroy.
